In [9]:
import pandas as pd

In [10]:
from pandas import Series, DataFrame

In [11]:
obj = pd.Series([4, 7, -5, 3])

In [12]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [13]:
obj.values()

TypeError: 'numpy.ndarray' object is not callable

In [ ]:
obj.values

In [ ]:
obj.index

In [ ]:
obj2 = pd.Series([4,7,-5,3], index = ['d', 'b', 'a', 'c'])

In [ ]:
obj2

In [ ]:
obj2.index

In [ ]:
obj2 = pd.Series([4,7,-5,3], index = ['1.1', '1.2', '1.3', '1.4'])

In [ ]:
obj2.index

In [ ]:
obj2

In [ ]:
obj2 = pd.Series([4,7,-5,3], index = ['d', 'b', 'a', 'c'])

In [ ]:
obj2

In [ ]:
obj2['a']

In [ ]:
obj2[['c', 'a', 'd']]

In [ ]:
obj2['d'] = 6

In [ ]:
obj2

In [ ]:
obj2[obj2>0]

In [ ]:
obj2 * 2

In [ ]:
obj2

In [ ]:
    b in obj2

In [ ]:
'b' in obj2

In [ ]:
sdata = {'Ohio' : 35000, 'Texas' : 71000, 'Oregon' : 16000, 'Utah' : 5000}

In [ ]:
obj3 = pd.Series(sdata)

In [ ]:
obj3

In [ ]:
states = ['California', 'Ohio', 'Oregon', 'Texas']

In [ ]:
obj4 = pd.Series(sdata, index = states)

In [ ]:
obj4

In [ ]:
pd.isnull(obj4)

In [ ]:
pd.notnull(obj4)

In [ ]:
obj3

In [ ]:
obj4

In [ ]:
obj3 + obj4

In [ ]:
obj4.name = 'population'

In [ ]:
import pandas as pd

In [ ]:
obj4.name = 'population'

In [ ]:
from pandas import Series, DataFrame

In [ ]:
sdata = {'ohio' : 35000, 'texas' : 71000, 'oregon' :16000, 'utah' : 5000}

In [ ]:
states = ['california', 'ohio', 'oregon', 'texas']

In [ ]:
obj4 = pd.Series(sdata)

In [ ]:
obj4

In [ ]:
obj4 = pd.Series(sdata, index = states)

In [ ]:
obj4

In [ ]:
obj4.name = 'population'

In [ ]:
obj4.index.name = 'state'

In [ ]:
obj4

In [ ]:
obj

In [ ]:
obj.index = ['bob', 'steve', 'jeff', 'ryan']

In [ ]:
obj

In [ ]:
obj.values('bob' : 24)

In [ ]:
obj.values

In [ ]:
obj.values = [24, 25, 26, 27]

In [ ]:
data = {'state' : ['ohio', 'ohio', 'ohio', 'nevada', 'nevada', 'nevada'],
       'year': [2000, 2001, 2002, 2001, 2002, 2003],
       'pop' : [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

In [ ]:
frame = pd.DataFrame(data)

In [ ]:
frame

In [ ]:
frame.head()

In [ ]:
pd.DataFrame(data, columns = ['year', 'state', 'pop'])

In [ ]:
frame2 = pd.DataFrame(data, columns = ['year', 'state', 'pop', 'debt'], index = ['one', 'two', 'three', 'four', 'five', 'six'])

In [ ]:
frame2

In [ ]:
frame2.columns

In [ ]:
frame2.year

In [ ]:
frame2['state']

In [ ]:
frame2['year']

In [ ]:
frame2.state

In [ ]:
frame2.year

In [ ]:
frame2.pop

In [ ]:
frame2.loc['three']

In [ ]:
frame2 = pd.DataFrame(data, columns = ['year', 'state', 'pop', 'debt'], index = ['one', 'two', 'three', 'four', 'five', 'six'])

In [14]:
frame2

NameError: name 'frame2' is not defined

In [ ]:
frame2.debt = 16.5

In [ ]:
frame2

In [ ]:
frame2['year']

In [ ]:
frame2['debt'] = np.arange(6.0)

In [ ]:
import numpy as np

In [ ]:
frame2['debt'] = np.arange(6.0)

In [ ]:
frame2

In [ ]:
val = pd.Series([-1.2, -1.5, -1.7], index = ['two', 'four', 'five'])

In [ ]:
val

In [ ]:
frame2['debt'] = val

In [ ]:
frame2

In [ ]:
frame2['eastern'] = frame2.state == 'ohio'

In [ ]:
frame2

In [ ]:
    del frame2.eastern

In [ ]:
del frame2['eastern']

In [ ]:
frame2.columns

In [ ]:
obj = pd.Series(range(3), index = ['a', 'b', 'c'])

In [ ]:
obj

In [ ]:
index = obj.index

In [ ]:
index

In [ ]:
labels = pd.Index(np.arange(3))

In [ ]:
labels

In [ ]:
obj2 = pd.Series([1.5, -2.5, 0], index = labels)

In [ ]:
obj2

In [ ]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index = ['d', 'b', 'a', 'c'])

In [ ]:
obj

In [ ]:
obj.reindex(['a', 'b', 'c', 'd', 'e'])

In [ ]:
obj

In [ ]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index = ['d', 'b', 'a', 'c'])

In [ ]:
obj

In [ ]:
frame = pd.DataFrame(np.arange(9).reshape(3,3),
                    index = ('a', 'c', 'd'), 
                    columns = ['ohio', 'texas', 'california'])

In [ ]:
import numpy as np

In [ ]:
frame

In [15]:
frame2 = frame.reindex(['a', 'b', 'c', 'd'])

NameError: name 'frame' is not defined

In [ ]:
frame2

In [ ]:
states = ['texas', 'utah', 'california']

In [ ]:
frame2.reindex(columns=states)

In [ ]:
obj = pd.Series(np.arange(4.0), index = ['a','b', 'c', 'd',])

In [ ]:
obj[2:4]

In [ ]:
obj[obj<2]

In [ ]:
obj[obj<0]

In [ ]:
obj[[1,3]]

In [ ]:
obj['b':'c']

Slicing with labels behaves differently than normal Python slicing in that the end-point is inclusive

In [ ]:
obj['b':'c'] = 5

In [ ]:
obj

In [ ]:
data = pd.DataFrame(np.arange(16).reshape(4,4), index = ['ohio', 'colorado', 'utah', 'new york'], columns = ['one', 'two', 'three', 'four'])

In [ ]:
data

In [ ]:
data['two']

In [ ]:
data['ohio']

In [ ]:
data[data['three'] > 5]

In [ ]:
data < 5

In [ ]:
data[data < 5] = 0

In [ ]:
data

In [ ]:
    data.loc['colorado', ['two', 'three']]

In [ ]:
data

In [ ]:
data.iloc[2, [3,0,1]]

In [ ]:
data.iloc[[1,2], [3, 0, 1]]

In [ ]:
data.three

In [ ]:
data.iloc[:, :3][data.three>5]

In [ ]:
ser = pd.Series(np.arange(3))

In [16]:
ser

NameError: name 'ser' is not defined

In [ ]:
ser2 = pd.Series(np.arange(3.), index = ['a', 'b', 'c'])

In [ ]:
ser2

In [ ]:
ser2[-1]

In [ ]:
ser[:1]

In [ ]:
ser.loc[:1]

In [ ]:
ser.iloc[:1]

In [ ]:
ser.iloc

In [ ]:
s1 = pd.Series([7.3, -2.5 ,3.4, 1.5], index = ['a', 'c','d', 'e'])

In [ ]:
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1], index = ['a' ,'c' ,'e' ,'f', 'g'])

In [ ]:
s1

In [ ]:
s2

In [ ]:
s1+s2

In [ ]:
df1 = pd.DataFrame(np.arange(9).reshape(3,3), columns = list('bde'), index = ['ohio', 'texas', 'colorado'])

In [ ]:
df2 = pd.DataFrame(np.arange(12).reshape(4,3), columns = list('bde'), index = ['utah', 'ohio', 'texas', 'oregon'])

In [ ]:
df1

In [ ]:
df2

In [ ]:
df1 + df2

Addition of above two dataframes returns a dataframe whose index and columns are the unions of the one in each dataframe. Since the 'c' and 'e' columns are not found in both DataFrame objects, they appear
as all missing in the result. The same holds for the rows whose labels are not common
to both objects.

In [ ]:
df1 = pd.DataFrame({'A' : [1,2]})

In [ ]:
df2 = pd.DataFrame({'B' : [3,4]})

In [ ]:
df1

In [ ]:
df2

In [ ]:
df1 - df2

If you add DataFrame objects with no column or row labels in common, the result
will contain all nulls:

In [ ]:
df1 = pd.DataFrame(np.arange(12).reshape(3,4), columns = list('abcd'))

In [ ]:
df2 = pd.DataFrame(np.arange(20).reshape(4,5), columns = list('abcde'))

In [17]:
df1

NameError: name 'df1' is not defined

In [ ]:
df2

In [ ]:
df2.loc[1, 'b']

In [ ]:
df2[1, 'b'] = np.nan

In [ ]:
df2

In [ ]:
df2 = pd.DataFrame(np.arange(20).reshape(4,5), columns = list('abcde'))

In [ ]:
df2.loc[1, 'b']

In [ ]:
df2.iloc[1, 1]

In [ ]:
df2.iloc[1, 2]

In [ ]:
df2.loc[1, 'b'] = np.nan

In [ ]:
df2

In [ ]:
df1 + df2

In [ ]:
df1.add(df2, fill_value = 0)

In [ ]:
df1

In [ ]:
df2

In [ ]:
df1.reindex(columns = df2.columns, fill_value = 0)

In [ ]:
arr = np.arange(12).reshape(3,4)

In [ ]:
arr

In [ ]:
arr-arr[0]

In [ ]:
frame = pd.DataFrame(np.arange(12).reshape(4,3), columns = list('bde'), index = ['utah','ohio', 'texas', 'oregon'])

In [ ]:
frame

In [ ]:
series = frame.iloc[0]

In [ ]:
series

In [ ]:
frame - series

In [ ]:
series2 = pd.Series(range(3), index = ['b', 'e', 'f'])

In [ ]:
series2

In [18]:
frame + series2

NameError: name 'frame' is not defined

In [ ]:
series3 = frame['d']

In [ ]:
frame

In [ ]:
series3

In [ ]:
frame.sub(series3, axis=0)

In [ ]:
obj = pd.Series(range(4), index = ['d', 'a', 'b', 'c'])

In [ ]:
obj.sort_index()

In [ ]:
frame = pd.DataFrame(np.arange(9).reshape(3,3), columns = ['d', 'b', 'a'] ,index = ['one', 'two', 'three'])

In [ ]:
frame

In [ ]:
frame.sort_index()

In [ ]:
frame

In [ ]:
frame.sort_index(axis = 1)

In [ ]:
frame.sort_index(axis=1, ascending = False)

In [ ]:
obj = pd.Series([4, 7, -3, 2])

In [ ]:
obj

In [ ]:
obj.sort_values()

In [ ]:
frame = pd.DataFrame({'b' : [4,7,-3,2], 'a' : [0,1,0,1]})

In [ ]:
frame

In [19]:
frame.sort_values(by = 'b')

NameError: name 'frame' is not defined

In [ ]:
frame.sort_values(by = ['a', 'b'])

In [ ]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5], [np.nan, np.nan], [0.75, -1.3]], index = ['a', 'b', 'c', 'd'], 
                 columns = ['one', 'two'])

In [ ]:
df

In [ ]:
df.sum()

In [ ]:
df.sum(axis=1)

In [ ]:
df.idxmax()

In [ ]:
obj = pd.Series(['a', 'a', 'b', 'c']*4)

In [ ]:
obj

In [ ]:
obj.describe()

In [ ]:
obj = pd.Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])

In [ ]:
uniques = obj.unique()

In [ ]:
uniques

In [ ]:
uniques.sort()

In [ ]:
uniques

In [ ]:
uniques.sort(ascending = False)

In [ ]:
uniques.sort.reverse()

In [ ]:
obj.value_counts()

In [ ]:
pd.value_counts(obj.values, sort = False)

## Data Loading, Storage & File Formats

In [ ]:
!cat examples/ex1.csv

In [ ]:
!cat examples/ex1.csv

In [ ]:
df = pd.read_csv('examples/ex1.csv')

In [ ]:
df

In [ ]:
pd.read_table('examples/ex1.csv', sep = ',')

In [20]:
parsed = pd.read_csv('examples/csv_mindex.csv', index_col = ['key1', 'key2'])

In [21]:
!cat examples/csv_mindex.csv

key1,key2,value1,value2
one,a,1,2
one,b,3,4
one,c,5,6
one,d,7,8
two,a,9,10
two,b,11,12
two,c,13,14
two,d,15,16

In [22]:
parsed = pd.read_csv('examples/csv_mindex.csv', index_col = ['key1', 'key2'])

In [23]:
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [24]:
df = pd.read_csv('examples/ex1.csv')

In [25]:
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [26]:
pd.read_table('examples/ex1.csv', sep=',')

/home/icpl11549/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: FutureWarning: read_table is deprecated, use read_csv instead.
  """Entry point for launching an IPython kernel.

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [27]:
pd.read_csv('examples/ex2.csv', header = None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [28]:
pd.read_csv('examples/ex2.csv', names = ['a', 'b', 'c', 'd', 'message'])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [29]:
names = ['a', 'b', 'c', 'd', 'message']

In [30]:
pd.read_csv('examples/ex2.csv', names = names, index_col = 'message')

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [31]:
parsed = pd.read_csv('examples/csv_mindex.csv', index_col = ['key1', 'key2'])

In [32]:
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [33]:
result = pd.read_csv('examples/ex5.csv')

In [34]:
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [35]:
pd.isnull(result)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [36]:
result = pd.read_csv('examples/ex5.csv', na_values = ['NaN'])

In [37]:
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [38]:
sentinels = {'message' : ['foo', 'NA'], 'something' : 'two'}

In [39]:
pd.read_csv('examples/ex5.csv', na_values = sentinels)

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       NaN  5   6   NaN   8   world
2     three  9  10  11.0  12     NaN

In [40]:
data = pd.read_csv('examples/ex5.csv')

In [41]:
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [42]:
data.to_csv('examples/out.csv')

In [43]:
!cat examples/out.csv

,something,a,b,c,d,message
0,one,1,2,3.0,4,
1,two,5,6,,8,world
2,three,9,10,11.0,12,foo

In [44]:
from numpy import nan as NA

In [45]:
data = pd.Series([1, NA, 3.5, NA, 7])

In [46]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [47]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [48]:
string_data = pd.Series(['abaabvca', 'hjsvcbliw', np.nan, 'juicnfn'])

NameError: name 'np' is not defined

In [ ]:
string_data

In [ ]:
import numpy as np

In [ ]:
string_data

In [ ]:
string_data.isnull()

In [ ]:
from numpy import nan as NA

In [ ]:
data = pd.Series([1, NA, 3.5, NA, 7])

In [ ]:
data.dropna()

In [ ]:
data[data.notnull()]

In [ ]:
data

In [ ]:
data = pd.DataFrame([[1, 6.5, 3], [1, NA, NA],
                    [NA, NA, NA], [NA, 6.5, 3]])

In [ ]:
cleaned = data.dropna()

In [ ]:
data

In [ ]:
cleaned

In [ ]:
df = pd.DataFrame(np.random.randn(7, 3))

In [ ]:
df

In [ ]:
df.iloc[:4, 1] = NA

In [ ]:
df

In [ ]:
df.iloc[:2, 2] = NA

In [ ]:
df

In [ ]:
df.dropna()

In [ ]:
df.dropna(thresh=2)

In [ ]:
df.fillna(0)

In [ ]:
df.fillna({1 : 0.5, 2:0})

In [ ]:
df.fillna(0, inplace = True)

In [ ]:
df

In [ ]:
data = pd.DataFrame({'k1' : [['one', 'two']*3, 'two'], 'k2' : [1,1,2,3,3,4,4]})

In [ ]:
k1 = [['one', 'two']*3, 'two']

In [ ]:
k1

In [ ]:
data = pd.DataFrame({'k1' : [['one', 'two']*3 + ['two']], 'k2' : [1,1,2,3,3,4,4]})

In [ ]:
k1 = [['one', 'two']*3 + ['two']]

In [ ]:
k1

In [ ]:
data = pd.DataFrame({'k1' : ['one', 'two']*3 + ['two'], 'k2' : [1,1,2,3,3,4,4]})

In [ ]:
data

In [ ]:
data.duplicated()

In [ ]:
data.drop_duplicates()

In [ ]:
data['v1'] = np.arange(7)

In [ ]:
import numpy as np

In [ ]:
data['v1'] = np.arange(7)

In [ ]:
data['v1'] = range(7)

In [ ]:
data.drop_duplicates(['k1'])

In [ ]:
data

In [ ]:
data.drop_duplicates(['k1', 'k2'], keep = 'last')

In [ ]:
data = pd.DataFrame({'food' : ['bacon', 'pulled pork', 'bacon', 'Pastrami', 'corned beef', 'Bacon', 'pastrami',
                              'honey ham', 'nova lox'], 
                    'ounces' : [4,3,12,6,7.5,8,3,5,6]})

In [ ]:
data

In [ ]:
meat_to_animal = {
    'bacon' : 'pig',
    'pulled pork' : 'pig',
    'pastrami' : 'cow',
    'corned beef' : 'cow',
    'honey ham' : 'pig',
    'nova lox' : 'salmon'}

In [ ]:
lowercased = data['food'].str.lower()

In [ ]:
lowercased

In [ ]:
data['animal'] = lowercased.map(meat_to_animal)

In [ ]:
data

In [ ]:
data= pd.Series([1., -999., 2., -999., -1000., 3.])

In [ ]:
data

In [ ]:
data.replace(-999, np.nan)

In [ ]:
data

In [ ]:
data.replace([-999, -1000], np.nan)

In [ ]:
data.replace([-999, -1000], [np.nan, 0])

In [ ]:
data.replace({-999 : np.nan, -1000 : 0})

In [ ]:
data = pd.DataFrame(np.arange(12).reshape(3,4), index = ['ohio', 'colorado', 'new york'], columns = ['one', 'two', 'three', 'four'])

In [ ]:
data

In [ ]:
data.rename(index = {'ohio' : 'indiana'}, columns = {'three' : 'peekaboo'})

In [ ]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [ ]:
bins = [18, 25, 35, 60, 100]

In [ ]:
cats = pd.cut(ages, bins)

In [ ]:
cats

In [ ]:
cats.codes

In [ ]:
cats.categories

In [ ]:
pd.value_counts(cats)

In [ ]:
pd.cut(ages, [18, 26, 36, 61, 100], right = False)

In [ ]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']

In [ ]:
pd.cut(ages, bins, labels=group_names)

In [ ]:
data = np.random.randn(20)

In [ ]:
pd.cut(data, 4, precision = 2)

In [ ]:
data

In [ ]:
data = np.random.randn(100, 5)

In [ ]:
data

In [ ]:
data.describe()

In [ ]:
data = pd.DataFrame(np.random.randn(1000, 4))

In [ ]:
data

In [ ]:
data.describe()

In [ ]:
col = data[2]

In [ ]:
col[np.abs(col)>3]

In [ ]:
data[(np.abs(data)>3).any(1)]

## Note:  Axis 0 will act on all rows in each column, while, Axis 1 will act on all columns in each row

In [ ]:
df = pd.DataFrame(np.random.randn(20).reshape(5,4))

In [ ]:
df

In [ ]:
sampler = np.random.permutation(5)

In [ ]:
sampler

In [ ]:
df.take(sampler)

In [ ]:
df = pd.DataFrame({'key' : ['b', 'b', 'a', 'c', 'a', 'b'],
                  'data1' : range(6)})

In [ ]:
pd.get_dummies(df['key'])

In [ ]:
val = 'a, b, guido'

In [ ]:
val.split(',')

In [ ]:
pieces = [x.strip() for x in val.split(',')]
pieces

In [ ]:
first, second, third = pieces

In [ ]:
first + '::' + second + '::' + third

In [ ]:
'::'.join(pieces)

In [ ]:
val

In [ ]:
val.index(',')

In [ ]:
val.index(':')

In [ ]:
val.find(':')

In [ ]:
val.count(',')

In [ ]:
val.replace(',','::')

In [ ]:
import re

In [ ]:
data = {'Dave' : 'dave@google.com' ,'Steve' : 'steve@gmail.com', 
       'Rob' : 'rob@gmail.com', 'Wes' : np.nan}

In [ ]:
data = pd.Series(data)
data

In [ ]:
data.isnull()

In [ ]:
data.str.contains('gmail')

In [ ]:
data = pd.Series(np.random.randn(9), index = [['a', 'a', 'a', 'b', 'b', 'c', 'c', 
                                              'd', 'd'], [1,2,3,1,3,1,2,2,3]])

In [ ]:
data

In [ ]:
data.index

In [ ]:
data['b']

In [ ]:
data['b':'c']

In [ ]:
data.loc[['b', 'd']]

In [ ]:
data.loc[:, 2]

In [ ]:
data.unstack()

In [ ]:
data.unstack().stack()

In [ ]:
frame = pd.DataFrame(np.arange(12).reshape(4,3), index = [['a', 'a', 'b', 'b'], [1,2,1,2]],
                    columns = [['ohio', 'ohio', 'colorado'], ['green', 'red', 'green']])

In [ ]:
frame

In [ ]:
frame.index.names = ['key1', 'key2']
frame.columns.names = ['state', 'colour']

In [ ]:
frame

In [ ]:
frame['ohio']

In [ ]:
frame.swaplevel('key1', 'key2')

In [ ]:
frame.sort_index(level = 1)

Here, in the above example, index level starts from 0 (always) and 'level 1' means sorting hierarchical indexes as per the ordex of level 1 indexes,

In [ ]:
frame

In [ ]:
frame.swaplevel(0,1).sort_index(level = 0)

In [ ]:
frame.sum(level = 'key2')

In [ ]:
frame.sum(level = 'colour', axis = 1)

In [ ]:
frame = pd.DataFrame({'a' : range(7), 'b' : range(7,0,-1), 'c' : ['one', 'one', 'one', 'two', 
                                                                  'two', 'two', 'two'],
                                                                  'd' : [0,1,2,0,1,2,3]})

In [ ]:
frame

In [ ]:
frame2 = frame.set_index(['c', 'd'])

In [ ]:
frame2

In [ ]:
frame = pd.DataFrame(np.arange(7), index = [['one', 'one', 'one', 'two', 'two', 'two',
                                                                 'two'], [0,1,2,0,1,2,3]])

In [ ]:
frame

In [ ]:
frame = pd.DataFrame(np.arange(7), np.arange(7, 0, -1), index = [['one', 'one', 'one', 'two', 'two', 'two',
                                                                 'two'], [0,1,2,0,1,2,3]])

### So as shown above, such hierarchical indexing is possible only when we have to index a given set of values. But, when we are supposed to index multiple sets of given values, we cannot use hierarchical indexing using above method. In such case, we have to use set_index function. It is demonstrated below:

In [ ]:
frame = pd.DataFrame({'a' : range(7), 'b' : range(7,0,-1), 'c' : ['one', 'one', 'one', 'two', 
                                                                  'two', 'two', 'two'],
                                                                  'd' : [0,1,2,0,1,2,3]})

In [ ]:
frame2 = frame.set_index(['c', 'd'])

In [ ]:
frame2

In [ ]:
frame2.reset_index()

In [49]:
df1 = pd.DataFrame({'key' : ['b', 'b', 'a', 'c', 'a', 'a' ,'b'], 
                  'data1' : range(7)})

In [50]:
df2 = pd.DataFrame({'key' : ['a', 'b', 'd'], 'data2' : range(3)})

In [51]:
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   a      5
6   b      6

In [52]:
df2

  key  data2
0   a      0
1   b      1
2   d      2

In [ ]:
pd.merge(df1, df2)

In [ ]:
df3 = pd.DataFrame({'lkey' : ['b', 'b', 'a', 'c', 'a', 'a', 'b'], 
                   'data1' : range(7)})

In [ ]:
df4 = pd.DataFrame({'rkey' : ['a', 'b', 'd'], 'data2' : range(3)})

In [ ]:
pd.merge(df3, df4, left_on = 'lkey', right_on = 'rkey')

In [ ]:
df1

In [ ]:
df2

In [ ]:
pd.merge(df1, df2, how = 'outer')

In [ ]:
d = {'name' : 'Tirthesh', 'age' : 22}

In [ ]:
d

In [53]:
df1 = pd.DataFrame({'key' : ['b', 'b', 'a', 'c', 'a', 'b'], 'data1' : range(6)})

In [54]:
df2 = pd.DataFrame({'key' : ['a', 'b', 'a', 'b', 'd'], 'data2' : range(5)})

In [56]:
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [57]:
df2

  key  data2
0   a      0
1   b      1
2   a      2
3   b      3
4   d      4

In [58]:
pd.merge(df1, df2, on = 'key', how = 'left')

   key  data1  data2
0    b      0    1.0
1    b      0    3.0
2    b      1    1.0
3    b      1    3.0
4    a      2    0.0
5    a      2    2.0
6    c      3    NaN
7    a      4    0.0
8    a      4    2.0
9    b      5    1.0
10   b      5    3.0

In [59]:
pd.merge(df1, df2, how = 'inner')

  key  data1  data2
0   b      0      1
1   b      0      3
2   b      1      1
3   b      1      3
4   b      5      1
5   b      5      3
6   a      2      0
7   a      2      2
8   a      4      0
9   a      4      2

In [60]:
left = pd.DataFrame({'key1' : ['foo', 'foo', 'bar'], 
                    'key2' : ['one', 'two', 'one'], 
                    'lval' : [1,2,3]})

In [62]:
right = pd.DataFrame({'key1' : ['foo', 'foo', 'bar', 'bar'], 
                     'key2' : ['one', 'one', 'one', 'two'], 
                     'rval' : [4,5,6,7]})

In [65]:
pd.merge(left, right, on = ['key1', 'key2'], how = 'outer')

  key1 key2  lval  rval
0  foo  one   1.0   4.0
1  foo  one   1.0   5.0
2  foo  two   2.0   NaN
3  bar  one   3.0   6.0
4  bar  two   NaN   7.0

In [66]:
left1 = pd.DataFrame({'key' : ['a', 'b', 'a', 'a', 'b', 'c'], 'value' : range(6)})

In [67]:
right1 = pd.DataFrame({'group_val' : [3.5, 7]}, index = ['a', 'b'])

In [68]:
left1

  key  value
0   a      0
1   b      1
2   a      2
3   a      3
4   b      4
5   c      5

In [69]:
right1

   group_val
a        3.5
b        7.0

In [70]:
pd.merge(left1, right1, left_on ='key', right_index = True)

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0

In [71]:
left2 = pd.DataFrame([[1,2], [3,4], [5,6]], index = ['a', 'c', 'e'], columns = ['ohio' ,'nevada'])

In [72]:
right2 = pd.DataFrame([[7,8], [9,10], [11,12], [13,14]], index = ['b', 'c', 'd', 'e'],
                     columns = ['missouri', 'alabama'])

In [73]:
left2

   ohio  nevada
a     1       2
c     3       4
e     5       6

In [74]:
right2

   missouri  alabama
b         7        8
c         9       10
d        11       12
e        13       14

In [75]:
pd.merge(left2, right2, how = 'outer', left_index = True, right_index = True)

   ohio  nevada  missouri  alabama
a   1.0     2.0       NaN      NaN
b   NaN     NaN       7.0      8.0
c   3.0     4.0       9.0     10.0
d   NaN     NaN      11.0     12.0
e   5.0     6.0      13.0     14.0

In [76]:
np.arange(12).reshape(3,4)

NameError: name 'np' is not defined

In [77]:
import numpy as np

In [79]:
arr = np.arange(12).reshape(3,4)

In [80]:
arr

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [81]:
np.concatenate([arr, arr], axis = 1)

array([[ 0,  1,  2,  3,  0,  1,  2,  3],
       [ 4,  5,  6,  7,  4,  5,  6,  7],
       [ 8,  9, 10, 11,  8,  9, 10, 11]])

In [82]:
s1 = pd.Series([0,1], index = ['a', 'b'])

In [83]:
s2 = pd.Series([2,3,4], index = ['c', 'd', 'e'])

In [84]:
s3 = pd.Series([5,6], index = ['f', 'g'])

In [85]:
s1

a    0
b    1
dtype: int64

In [86]:
s2

c    2
d    3
e    4
dtype: int64

In [87]:
s3

f    5
g    6
dtype: int64

In [88]:
pd.concat([s1, s2, s3])

a    0
b    1
c    2
d    3
e    4
f    5
g    6
dtype: int64

In [89]:
pd.concat([s1, s2, s3], axis = 1)

/home/icpl11549/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

     0    1    2
a  0.0  NaN  NaN
b  1.0  NaN  NaN
c  NaN  2.0  NaN
d  NaN  3.0  NaN
e  NaN  4.0  NaN
f  NaN  NaN  5.0
g  NaN  NaN  6.0

In [90]:
s4 = pd.concat([s1, s3])

In [91]:
s4

a    0
b    1
f    5
g    6
dtype: int64

In [92]:
pd.concat([s1, s4], axis = 1)

/home/icpl11549/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

     0  1
a  0.0  0
b  1.0  1
f  NaN  5
g  NaN  6

In [95]:
result = pd.concat([s1, s1, s3], keys = ['one', 'two', 'three'])

In [96]:
result

one    a    0
       b    1
two    a    0
       b    1
three  f    5
       g    6
dtype: int64

In [97]:
result.unstack()

         a    b    f    g
one    0.0  1.0  NaN  NaN
two    0.0  1.0  NaN  NaN
three  NaN  NaN  5.0  6.0

In [98]:
df1 = pd.DataFrame(np.random.randn(3,4), columns = ['a', 'b', 'c', 'd'])

In [101]:
df2 = pd.DataFrame(np.random.randn(2,3), columns = ['b', 'd', 'a'])

In [102]:
a = pd.Series([np.nan, 2.5, np.nan, 3.5, 4.5, np.nan], 
             index = ['f', 'e', 'd', 'c', 'b', 'a'])

In [103]:
b = pd.Series(np.arange(len(a), dtype = np.float64), index = ['f', 'e', 'd', 'c', 'b' ,'a'])

In [104]:
b[-1]

5.0

In [105]:
b[-1] = np.nan

In [106]:
a

f    NaN
e    2.5
d    NaN
c    3.5
b    4.5
a    NaN
dtype: float64

In [107]:
b

f    0.0
e    1.0
d    2.0
c    3.0
b    4.0
a    NaN
dtype: float64

In [109]:
np.where(pd.isnull(a), b, a)

array([0. , 2.5, 2. , 3.5, 4.5, nan])

In [110]:
b[:-2].combine_first(a[2:])

a    NaN
b    4.5
c    3.0
d    2.0
e    1.0
f    0.0
dtype: float64

In [111]:
df1 = pd.DataFrame({'a' : [1, np.nan, 5, np.nan], 
                   'b' : [np.nan, 2, np.nan, 6],
                   'c' : range(2, 18, 4)})

In [112]:
df2 = pd.DataFrame({'a' : [5, 4, np.nan, 3, 7], 
                   'b' : [np.nan, 3, 4, 6, 8]})

In [113]:
df1

     a    b   c
0  1.0  NaN   2
1  NaN  2.0   6
2  5.0  NaN  10
3  NaN  6.0  14

In [114]:
df2

     a    b
0  5.0  NaN
1  4.0  3.0
2  NaN  4.0
3  3.0  6.0
4  7.0  8.0

In [115]:
df1.combine_first(df2)

     a    b     c
0  1.0  NaN   2.0
1  4.0  2.0   6.0
2  5.0  4.0  10.0
3  3.0  6.0  14.0
4  7.0  8.0   NaN

In [119]:
data = pd.DataFrame(np.arange(6).reshape(2,3), index = pd.Index(['ohio', 'colorado'], name = 'state'), 
                   columns = pd.Index(['one', 'two', 'three'], name = 'number'))

In [120]:
data

number    one  two  three
state
ohio        0    1      2
colorado    3    4      5

In [121]:
result = data.stack()

In [123]:
result

state     number
ohio      one       0
          two       1
          three     2
colorado  one       3
          two       4
          three     5
dtype: int64

In [124]:
result.unstack()

number    one  two  three
state
ohio        0    1      2
colorado    3    4      5

In [126]:
data.T

state   ohio  colorado
number
one        0         3
two        1         4
three      2         5

### So, stack() operation converts a dataframe into a hierarchically indexed series. Similarly, unstack() operation enables us to rearrange a hierarchically indexed series back into a dataframe.

In [127]:
s1 = pd.Series([0,1,2,3], index = ['a', 'b', 'c', 'd'])

In [128]:
s2 = pd.Series([4,5,6], index = ['c', 'd', 'e'])

In [129]:
s1

a    0
b    1
c    2
d    3
dtype: int64

In [130]:
s2

c    4
d    5
e    6
dtype: int64

In [131]:
data2 = pd.concat([s1, s2], keys = ['one', 'two'])

In [133]:
data2

one  a    0
     b    1
     c    2
     d    3
two  c    4
     d    5
     e    6
dtype: int64

In [134]:
data2.unstack()

       a    b    c    d    e
one  0.0  1.0  2.0  3.0  NaN
two  NaN  NaN  4.0  5.0  6.0